android/AndroidClient/res/raw/renametab.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <RenameTab xmlns="http://tempuri.org/">
      <tabid>{id}</tabid>
      <newName>{newname}</newName>
    </RenameTab>
  </soap:Body>
</soap:Envelope>